//Напишите программу,которая 
//на входе принимает число и 
//на выходе выдает его квадрат.

Console.WriteLine("Введите число: ");
double number = Convert.ToDouble(Console.ReadLine());

Console.WriteLine(number * number);